tap "homebrew/bundle"
tap "homebrew/cask", "https://github.com/Homebrew/homebrew-cask.git"
tap "homebrew/cask-drivers", "https://github.com/Homebrew/homebrew-cask-drivers.git"
tap "homebrew/cask-fonts", "https://github.com/Homebrew/homebrew-cask-fonts.git"
tap "homebrew/cask-versions", "https://github.com/Homebrew/homebrew-cask-versions.git"
tap "homebrew/core", "https://github.com/Homebrew/homebrew-core.git"
tap "homebrew/services"


# infra
brew "k3d"

# doc & blog
brew "hugo"

# secret
brew "gnupg"
cask "keybase"
mas "1Password 7", id: 1333542190

# git & github
brew "git"
brew "pre-commit"
brew "gh"
brew "talisman"
brew "git-crypt"

# tools
brew "tmux"
cask "maczip"
brew "ncdu"
brew "jq"
brew "chezmoi"
brew "coreutils"
cask "balenaetcher"
mas "Mate Translate", id: 1005088137

# system tooling
brew "mas"
brew "neofetch"
cask "appcleaner"
mas "Xnip", id: 1221250572
mas "PopClip", id: 445189367
mas "Hidden Bar", id: 1452453066
mas "Magnet", id: 441258766
mas "Best Trace", id: 1037779758

# mointor
brew "htop"
cask "istat-menus"

# pentest
brew "sqlmap"
brew "aircrack-ng"
brew "hashcat"
brew "hping"
brew "nmap"
brew "john-jumbo"

# golang
brew "go"

# node
brew "node"
brew "n"

# network
brew "wget"
brew "aria2"
brew "ipcalc"
brew "mtr"
cask "wireshark"
cask "paw"
brew "you-get"
brew "telnet"

# proxy
brew "v2ray", greedy: true
cask "clashx", greedy: true

# docker
brew "docker"
brew "colima"

# media
brew "libav"
brew "ffmpeg"
cask "iina"
cask "plex"
cask "plexamp"

# terminal
cask "iterm2"

# browser
cask "microsoft-edge"
cask "google-chrome"

# news
cask "netnewswire"

# synology
cask "synology-drive", greedy: true

# chat & meeting
cask "telegram", greedy: true
cask "zoom"
mas "微信", id: 836500024
mas "QQ", id: 451108668

# coding
brew "glib"
brew "neovim"
brew "pyenv"
cask "visual-studio-code"
mas "SnippetsLab", id: 1006087419
brew "semgrep"

# device support
cask "logitech-options"
cask "logitech-g-hub"

# note
brew "pandoc"
cask "logseq", greedy: true
cask "zotero"
cask "picgo"
mas "GoodNotes", id: 1444383602
mas "MWeb Pro", id: 1403919533

# font
cask "font-cascadia"

# work
mas "Keynote 讲演", id: 409183694
mas "Numbers 表格", id: 409203825
mas "Pages 文稿", id: 409201541

# gaming
cask "steam"

{{ if .personal }}
## Personal

# coding
cask "goland"

{{ else }}

## Non Personal

tap "aquasecurity/trivy"

# chat
mas "企业微信", id: 1189898970

# pentester
cask "burp-suite-professional"

# coding
cask "intellij-idea"

# tool
cask "alfred"
cask "google-drive"

# secret
cask "1password-cli"

# cloud
cask "google-cloud-sdk"


# java
brew "gradle"
brew "maven"

# tool
mas "Microsoft Excel", id: 462058435
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704

{{ end }}